Revit 2027 API
BuiltInFailures.SiteImportFailures.SurfaceExists Property
 You are importing data into a surface that already contains points. You may want to go back, create a new surface, and import the data into that instead. You can continue, and Revit will sew the meshes together, but the boundary may be larger than you want.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceExists { get; }
Public Shared ReadOnly Property SurfaceExists As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceExists {
	FailureDefinitionId^ get ();
}
static member SurfaceExists : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace